imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
  /* Enable GPIO clock */
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); //前面已经开过了

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
	

  /* Configure USART Tx as alternate function push-pull */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_Init(GPIOC, &GPIO_InitStructure);


  /* Configure USART Rx as input floating */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_Init(GPIOC, &GPIO_InitStructure);

  /* USART configuration */
  USART_Init(USART3, &USART_InitStructure);
	USART_Init(UART4, &USART_InitStructure);
    
  /* Enable USART */
  USART_Cmd(USART3, ENABLE);
	USART_Cmd(UART4, ENABLE);
	
	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
	USART_ITConfig(UART4, USART_IT_RXNE, ENABLE);
}

void NVIC_Configuration(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Configure the NVIC Preemption Priority Bits */  
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);
  
  /* Enable the USART3 Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Configure the nested vectored interrupt controller.
  * @param  None
  * @retval None
  */


void MEASUREMENT(void)
{unsigned int i,j,k;
	
	RCC_ClocksTypeDef RCC_Clocks;
  RCC_GetClocksFreq(&RCC_Clocks);
	i = 2100;	
  while(i>=1000)
	{
		for(k=0;k<1;k++)
		{
          		j = i;
          		GPIO_SetBits(STRING_GPIO, STRING_PIN);  	
          		while(j)
             	{    
              		__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								 /* __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();*/
				           j=j-1;
              	}  
          		j = i;
          		GPIO_ResetBits(STRING_GPIO, STRING_PIN);         		
          		while(j)
              	{  
               	 __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								 /*__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								 __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								 __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								 __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
								  __nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();*/
                  	j=j-1;
              	}          
           } 
	i = i-1;
  				 
	}
	
	DELAY(1500);                                                                                                                                                                                                                       
}

void DELAY(__IO uint32_t nCount)
{
  	unsigned int i,j;
	
  	for(i=0;i<50;i++)
  	{
	  	for(j=0;j<nCount;j++)
   		{
	   		__nop();
    	}
   } 	
}

void uart_zigbee_senddata(uint8_t *str)
{
	int i;
	for(i = 0;i < 36;i ++)
	{
		USART_SendData(USART3, *(str + i));

		/* Loop until the end of transmission */
		while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET)
		{}
	}
}

void uart_485_senddata(uint8_t *str, uint8_t num)
{
	int i;
	for(i = 0;i < num;i ++)
	{
		USART_SendData(UART4, *(str + i));

		/* Loop until the end of transmission */
		while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET)
		{}
	}
}

PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
  USART_SendData(USART3, (uint8_t) ch);

  /* Loop until the end of transmission */
  while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET)
  {}

  return ch;
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  while (1)
  {}
}

#endif

/**
  * @}
  */ 

/**
  * @}
  */ 

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
